%% 计算针阀升程对应的小孔面积
function [A]=cal_needlearea(x)
dt=0.01;     %确定时间步长
for i=1:246
    if (i-1)*dt>0&&(i-1)*dt<=0.33
        A(i)=pi*(2.5*tan(9*pi/180)*x(i,2)+tan(9*pi/180)*tan(9*pi/180)*x(i)*x(i,2));     %在这个时间区域内针阀上升，S环<S孔，喷油嘴的喷油速率由环决定
    end
    if (i-1)*dt>0.33&&(i-1)*dt<=2.12
        A(i)=0.49*pi;                                   %在这个时间区域内针阀上升，S环>S孔，喷油嘴的喷油速率由孔决定
    end
    if (i-1)*dt>2.12&&(i-1)*dt<=2.44
        A(i)=pi*(2.5*tan(9*pi/180)*x(i,2)+tan(9*pi/180)*tan(9*pi/180)*x(i)*x(i,2));    %在这个时间区域内，针阀下降，S环<S孔，喷油嘴喷油速率由环决定
    end
    if (i-1)*dt>2.44&&(i-1)*dt<=2.45
        A(i)=0;                                       %在这个时间区域内，针阀下降到0位置并保持不变，喷油嘴不喷油
    end
end
A=A';
A=[x(:,1),A];
B=2.46:0.01:100;
B=B';
C=zeros(9755,1);
B=[B,C];
A=[A;B];
